#include "tasks.h"

/*	Task 07. Number Digit Max [максимальная цифра числа]
*
*	Дано целое число. Необходимо найти максимальную цифру заданного числа.
*
*	Формат входных данных [input]
*	На вход подаётся целое число в диапазоне типа long.
*
*	Формат выходных данных [output]
*	Должна быть возвращена максимальная цифра числа - результат решения задания.
*
*	[ input 1]: 98765
*	[output 1]: 9
*
*	[ input 2]: 13245
*	[output 2]: 5
*
*	[ input 3]: 11111
*	[output 3]: 1
*
*	[ input 4]: 0
*	[output 4]: 0
*
*	[ input 5]: -12345
*	[output 5]: 5
*/

int task07(long number) {
	return 0;
}